assignment2/part8/MeshD/dt=0.05/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U);
probeLocations
(
   (1.0 0.0 0.5)
   (2.0 0.0 0.5)
   (3.0 0.0 0.5)
   (1.0 0.5 0.5)
   (2.0 0.5 0.5)
   (3.0 0.5 0.5)
   (1.0 -0.5 0.5)
   (2.0 -0.5 0.5)
   (3.0 -0.5 0.5)
   (1.0 -1.5 0.5)
   (2.0 -1.5 0.5)
   (3.0 -1.5 0.5)
   (1.0 1.5 0.5)
   (2.0 1.5 0.5)
   (3.0 1.5 0.5)
);

// ************************************************************************* //
